tutorials/squareCylinder/Allrun.parallel
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh
runApplication snappyHexMesh -overwrite
runApplication checkMesh

runApplication topoSet
runApplication createZonesField

runApplication decomposePar -force
runApplication mpirun -np 12 pisoFoam -parallel
runApplication reconstructPar

runApplication foamToVTK
